Revit 2025 API
ElectricalSystem.VoltageDrop Property
 The VoltageDrop value of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double VoltageDrop { get; }
Public ReadOnly Property VoltageDrop As Double
	Get
public:
property double VoltageDrop {
	double get ();
}
member VoltageDrop : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power! -or- Thrown when the voltage drop cannot be computed, because it is zero, or because the circuit is not connected to a panel.
Remarks
 This property is used to retrieve the VoltageDrop value of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace